# BuildingPadOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..BuildingPadOverlap Property
BuiltInFailures..::..SiteFailures Class See Also
---
Pads can't overlap (but can share edges).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BuildingPadOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingPadOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BuildingPadOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace